package MiniTasks.src;

public class AAAAAA {
//Найти позицию подстроки жава в строке АйЛайкЖава!!! Убедиться что строка заканчивается подстрокой !!!
    //Заменить все символы а на о






    public static void main(String[] args) {
        String s1 = new String();
        String s2 = new String();
        WorkString workString = new WorkString();
        workString.sTR();


        //s1 = "I Like Java!!!";s2 = "Java";
        //System.out.println(s1.indexOf(s2));
        //System.out.println(s1.replace("a", "o"));





        //s1.substring(7, )
        //System.out.println(s1.indexOf(s2));
        //System.out.println(s1.endsWith("!!!"));

        //System.out.println(s1.l);

    }
}
